Revit 2027 API
DistributionSysTypeSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DistributionSysTypeSetIterator ReverseIterator()
Public Overridable Function ReverseIterator As DistributionSysTypeSetIterator
public:
virtual DistributionSysTypeSetIterator^ ReverseIterator()
abstract ReverseIterator : unit -> DistributionSysTypeSetIterator
override ReverseIterator : unit -> DistributionSysTypeSetIterator
Return Value
DistributionSysTypeSetIterator
Returns a backward moving iterator to the set.
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace